app/views/cpus/new.html.haml

  %br
  =f.select :brand_id, Brand.all.collect {|p| [ p.brand_name, p.id ] }, { include_blank: true },id:'ec4'
---
SELECT `brands`.* FROM `brands`

  %br
  =f.select :company_id, Company.all.collect {|p| [ p.company_name, p.id ] }, { include_blank: true },id:'ec5'
---
SELECT `companies`.* FROM `companies`

  %br
  =f.select :socket_cpu_id, SocketCpu.all.collect {|p| [ p.socket_name, p.id ] }, { include_blank: true },id:'ec6'
---
SELECT `socket_cpus`.* FROM `socket_cpus`