app/views/vgas/new.html.haml

SELECT `brands`.* FROM `brands`
---
  %br
  =f.select :brand_id, Brand.all.collect {|p| [ p.brand_name, p.id ] }, { include_blank: true },id:'ec4'

SELECT `companies`.* FROM `companies`
---
  %br
  =f.select :company_id, Company.all.collect {|p| [ p.company_name, p.id ] }, { include_blank: true },id:'ec5'