app/views/calcs/new.html.haml

SELECT  `brands`.* FROM `brands` WHERE `brands`.`brand_name` = 'DDR' LIMIT 1
SELECT  `companies`.* FROM `companies` WHERE `companies`.`id` = 1 LIMIT 1
SELECT  `socket_cpus`.* FROM `socket_cpus` WHERE `socket_cpus`.`id` = 1 LIMIT 1
---
  %br
  =f.select :cpu_id, Cpu.all.collect {|p| [ (Company.find(p.company_id).company_name+' '+Brand.find(p.brand_id).brand_name+' Socket '+SocketCpu.find(p.socket_cpu_id).socket_name+' '+p.name).to_s, p.id ] }, { include_blank: true },id:'ec1'

SELECT `water_coolings`.* FROM `water_coolings`
---
  %br
  =f.select :water_cooling_id, WaterCooling.all.collect {|p| [ 'Pomp '+p.pomp_count.to_s+'x'+', Fan'+p.fan_count.to_s+'x', p.id ] }, { include_blank: true },id:'ec7'

SELECT `motherboards`.* FROM `motherboards`
---
  %br
  =f.select :motherboard_id, Motherboard.all.collect {|p| [ p.name, p.id ] }, { include_blank: true },id:'ec8'