app/controllers/calcs_controller.rb

  def create
    @cpu = Cpu.find(calc_params[:cpu_id])
    @vga = Vga.find(calc_params[:vga_id])
    @ram = Ram.find(calc_params[:ram_id])
    @wat = WaterCooling.find(calc_params[:water_cooling_id])
    @math = Motherboard.find(calc_params[:motherboard_id])
---
SELECT  `cpus`.* FROM `cpus` WHERE `cpus`.`id` = 7 LIMIT 1
SELECT  `vgas`.* FROM `vgas` WHERE `vgas`.`id` = 3 LIMIT 1
SELECT  `rams`.* FROM `rams` WHERE `rams`.`id` = 12 LIMIT 1
SELECT  `water_coolings`.* FROM `water_coolings` WHERE `water_coolings`.`id` = NULL LIMIT 1
SELECT  `motherboards`.* FROM `motherboards` WHERE `motherboards`.`id` = NULL LIMIT 1