app/controllers/cpus_controller.rb

  def create
    @cpu = Cpu.create(cpu_params)
---
INSERT INTO `cpus` (`brand_id`, `company_id`, `name`, `power`, `socket_cpu_id`, `created_at`, `updated_at`) VALUES (6, 1, 'G1820', 53, 1, '2017-01-23 10:23:30', '2017-01-23 10:23:30')