app/controllers/vgas_controller.rb

INSERT INTO `vgas` (`vga_name`, `company_id`, `vga_power`, `created_at`, `updated_at`, `brand_id`) VALUES ('GT 730', 3, 49, '2017-01-23 11:06:03', '2017-01-23 11:06:03', 25)
---
  def create
    @vga = Vga.create(vga_params)